## Plan result
[Build details](https://github.com/yuya-takeyama/terraform-modules/actions/runs/1084984828)
<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository.readonly-poly-repo[&#34;bar&#34;]
  * github_repository.readonly-poly-repo[&#34;foo&#34;]
<details>
<summary>Command output</summary>


```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.readonly-poly-repo["bar"] will be created
  + resource "github_repository" "readonly-poly-repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository is read only"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-module-bar"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_repository.readonly-poly-repo["foo"] will be created
  + resource "github_repository" "readonly-poly-repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository is read only"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-module-foo"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":1,"Program":"tfcmt","SHA1":"09a443a72acccd0d30f0967ad3524cda6d786d3a","Vars":{},"WorkflowName":"test"} -->